
Функция ДобавитьКДате(БазоваяДата, ВидПериода, Количество) Экспорт
	
	Рез = 0;
	Запрос = Новый Запрос;
	ТекстЗапроса =
		"ВЫБРАТЬ ДОБАВИТЬКДАТЕ(&БазоваяДата, %Тип%, &Смещение) КАК Результат";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Тип%", ВидПериода);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("БазоваяДата", БазоваяДата);
	Запрос.УстановитьПараметр("Смещение", Количество);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Рез = ВыборкаДетальныеЗаписи.Результат;
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции